from ext import db, app
from flask import render_template, request, redirect, url_for
from forms import registerForm, HistoryForm
from os import path

from models import History

profiles = []

geohistory = [
    {"id": 1, "name": "ალავერდი", "describe": "კახეთში, ახმეტის რაიონში, კავკასიონის მთების ძირში, მდინარე ალაზნის ველზე შუა საუკუნეების ერთ-ერთი ყველაზე ცნობილი და სახელგანთქმული ტაძარი - ალავერდი მდებარეობს, რომლის აგება ერთ-ერთი ასურელი მამის, იოსებ ალავერდელის სახელს უკავშირდება.", "img": "image1.jpg", "history": "ალავერდის მონასტერი VI საუკუნეში დააარსა იოსებ ალავერდელმა, ერთ-ერთმა 12 ასურელ მამათაგანმა. მდებარეობს ალაზნის ველზე, კავკასიონის ქედის თოვლიანი მთების ფონზე, თელავიდან 20 კმ-ში. დღეს არსებული წმ. გიორგის ტაძარი XI ს-ის პირველ მეოთხედში ააგო კვირიკე კახთა მეფემ ძველი პატარა ეკლესიის ადგილას. საქართველოში ერთ-ერთი უდიდესი საკათედრო ტაძარი (41,7 მ X 26,4 მ) სიმაღლით 50 მეტრზე მეტია.ალავერდი XI საუკუნიდან საეპისკოპოსო ცენტრი და ეპარქიის მღვდელმთავართა რეზიდენცია იყო. ამავე საუკუნიდან ალავერდის ტაძარი კახეთის სამეფო სახლის საძვლედაც იქცა.ალავერდის ტაძარი მრავალჯერ დაზიანებულა მომხდურთაგან და მიწისძვრებისაგან. მისი პირველი დიდი რესტავრაციისას (ალექსანდრე კახთა მეფის დროს, XV საუკუნის 80-იან წლებში) აღადგინეს გუმბათის ყელი მთლიანად და კედლების ცალკეული ნაწილები. 1742 მიწისძვრის დროს დაზიანებული ალავერდის რესტავრაცია დაიწყო დედოფალმა თამარმა (1750) და დაამთავრა ერეკლე II-მ. ტაძრის ყველა აღდგენილი ნაწილი აგურით არის ნაგები. XIX საუკუნის ბოლოს ალავერდის ტაძარი შიგნით მთლიანად შეათეთრეს. კედლების გაწმენდის შემდეგ (1966) გამოვლინდა მხატვრობის რამდენიმე ფენა: პირველი და უმნიშვნელოვანესია XI საუკუნის მოხატულობის ფრაგმენტები. სამხრეთის მკლავის კედლებზე შემორჩენილია XV-XVI საუკუნეების, ხოლო დასავლეთ და ჩრდილოეთ კედლებზე XVI-XVII საუკუნეების ფრესკები.ალავერდის ხუროთმოძღვრულ კომპლექსში, რომელსაც გარშემორტყმული აქვს გალავანი (XVII-XVIII სს.), გაერთიანებულია სხვადასხვა დროის ნაგებობები. პალატი, რომელიც საქართველოს ამ ტიპის ნაგებობათა შორის ერთ-ერთი ყველაზე მნიშვნელოვანია, სამსართულიანი შენობაა. მისი ქვედა სართული - დიდი ზომის კამაროვანი დარბაზი, XVI-XVII საუკუნეებში სატრაპეზო ყოფილა. 1615 ახლო პერიოდშია აგებული განჯის მმართველის, ფეიქარ-ხანის აგურის სასახლე, მისი მთავარი სადგომია რვაწახნაგა, კამარით გადახურული და ფართო თაღებით გახსნილი ნაგებობა, რომელზედაც დაბალი, კვადრატული ოთახია მიშენებული. არის სხვა საცხოვრებელი ნაგებობებიც, აგრეთვე აბანო, მარანი, სამრეკლო და სხვა. თავდაპირველად, ალავერდი მამათა მონასტერი იყო. XVII-XVIII საუკუნეებში კი აქ დაარსდა დედათა მონასტერიც, სადაც მონაზვნად აღკვეცილი სამეფო ოჯახის წევრები ცხოვრობდნენ. ალავერდში ლიტერატურულ საქმიანობას ეწეოდნენ ქართველი მწერლები, კალიგრაფები, მწიგნობარნი, მ.შ. ფილიპე ალავერდელი (XVI-XVII სს.), ზებედე მთავარეპისკოპოსი (XVII ს.), ნიკიფორე ირბახი (ნიკოლოზ ჩოლოყაშვილი, XVII ს.), მარიამ-მაკრინე ბაგრატიონი (XVIII ს.) და სხვები."},
    {"id": 2, "name": "კაცხის სვეტი", "describe": "თუ გინდა, ნახო ტაძარი ცაში, იმერეთში, ჭიათურასთან ახლოს, სოფელ კაცხში უნდა ჩახვიდე. კაცხის სვეტი მარტო ისტორიული ძეგლი კი არა, ბუნების ძეგლიცაა - აქ, მიწიდან 40 მ სიმაღლეზე, კირქვის სვეტის თავზე გასული საუკუნის 40-იან წლებში V-VI საუკუნეების ეკლესიებისა და სხვა ნაგებობების ნაშთი აღმოაჩინეს.", "img": "image.2.jpg", "history": "კაცხის სვეტი — კირქვის სვეტისებრი დენუდაციური „მოწმე“ — შთენილი კლდე იმერეთის მხარეში ჭიათურის მუნიციპალიტეტის სოფელ კაცხში, მდინარეების კაცხურისა (ყვირილის მარჯვენა შენაკადი) და ღვითორის (ბუჯის მარცხენა შენაკადი) წყალგამყოფზე.სვეტის სიმაღლე 40 მეტრია. ზოგიერთი მკვლევარი მიიჩნევს, რომ კაცხის სვეტი თავდაპირველად მონოფიზიტ განდეგილთა სამყოფელს წარმოადგენდა, თუმცა ეს მოსაზრება საყოველთაოდ არაა გაზიარებული, სათანადო არგუმენტაციის არქონის გამო. სვეტის ზედა ბაქანზე დგას ორი მცირე ზომის ეკლესია (დღეისათვის ისინი ნანგრევების სახითაა შემორჩენილი). ასეთ ადგილებში სამლოცველოების აგებას მკვლევრები უკავშირებენ მესვეტეობას, რომელიც VI საუკუნეში გავრცელებული იყო წინა აზიასა და, უპირველეს ყოვლისა, სირიაში, რომელთანაც ქრისტიანულ საქართველოს მჭიდრო ურთიერთობა ჰქონდა. ერთი ეკლესია (V ს.) მშრალადაა ნაშენი ადგილობრივად მოპოვებული, უხეშად დამუშავებული ქვით, აფსიდი კლდეშია გამოკვეთილი. მეორე (VI ს.) ნაგებია ქვემოდან აზიდული კარგად გათლილი კვადრებით, აქვს კრიპტა (ქვედა სართული — სამარხი). არავინ იცის ზუსტად როდის შეწყდა რელიგიური ცხოვრება კაცხის სვეტზე, მაგრამ ვახუშტი ბატონიშვილის დროს აქ ბერები აღარ მოღვაწეობდნენ.კაცხის სვეტის არქიტექტურული ძეგლები 1944 წელს ალექსანდრე ჯაფარიძის ხელმძღვანელობით მთამსვლელთა ჯგუფმა ინახულა. ბოლო პერიოდამდე კაცხის სვეტზე ასვლა, ალპინისტური აღჭურვილობის გარეშე, შეუძლებელი იყო.2007 წლიდან კულტურული მემკვიდრეობის დაცვის და გადარჩენის ფონდის დაფინანსებით დაიწყო სვეტზე არსებული ნაგებობების სარეაბილიტაციო სამუშაოები. კაცხის სვეტზე ასვლა აკრძალულია. გამონაკლის შემთხვევებში, ადგილობრივი ბერების ლოცვა-კურთხევით, სვეტზე მხოლოდ მამაკაცების ასვლაა შესაძლებელი. აღდგენილია სვეტის ძირში და თავზე არსებული სამლოცველოები, რაც სვეტზე ამჟამად მოღვაწე ბერი მაქსიმეს დამსახურებაა.2007 წელს კაცხის სვეტზე არსებულ ნანგრევებში მამა მაქსიმემ აღმოაჩინა კირქვის მცირე ქვათლილი (ზომები 41X21 სმ), რომელზეც ათსტრიქონიანი ქართული ასომთავრული წარწერაა ამოკაწრული. წარწერა პალეოგრაფიული ნიშნებით XIII საუკუნით თარიღდება. წარწერაში მოხსენიებულია ვინმე ფრიად ცოდვილი გიორგი, რომელსაც „სამი სახლაკი“ აუშენებია „ძელი ცხოვრებაზე“ — ანუ სვეტის თავზე დამკვიდრებულ დაყუდებულთათვის.[1]"},
    {"id": 3, "name": "უფლისციხე", "describe": "აქ ნახავ გასაოცარი დაგეგმარების მქონე კლდეში ნაკვეთ ქუჩებსა და მოედნებს, არხებს, გვირაბებს, გალავნებს, სხვადასხვა დანიშნულების ნაგებობებს. აქ აღმოჩენილი არტეფაქტები ხელოვნების მუზეუმში ინახება. მათ შორის საინტერესოა მძივები, ბეჭდები, ჭურჭლის ფრაგმენტები, ერთ-ერთი მნიშვნელოვანი აღმოჩენა კი ტერაკოტის ქანდაკებაა ქალღმერთის გამოსახულებით, რომელიც ძვ.წ. IV-III საუკუნეებითაა დათარიღებული.", "img": "image3.jpg", "history": "უფლისციხის კლდეში ნაკვეთ ანსამბლსა და მის გარშემო დაჯგუფებულ დასახლებებს განვითარების გრძელი გზა გაუვლიათ. კლდეში ნაკვეთი დასახლება ჯერ უფლისციხის მიდამოებში მცხოვრები თემების ჰეგემონი თემის საცხოვრისი გამხდარა, შემდეგ კი - ზენა სოფლის (შიდა ქართლის) ტომთა გაერთიანების ცენტრი, სადაც ამ გაერთიანების მეთაური (მამასახლისი), უფალი მჯდარა (აქედან სახელწოდება უფლისციხე). ადრინდელი ანტიკური ხანიდან (ძველი წელთაღრიცხვით VI-IV საუკუნეები) უფლისციხე ქალაქური ტიპის დასახლება იყო, რომელიც ადრინდელი ელინისტურ ხანაში (ძველი წელთაღრიცხვით IV საუკუნის დასასრულს - III საუკუნე) მსხვილ საქალაქო ცენტრად იქცა. ძველ კლდეში ნაკვეთი დასახლება კი ანტიკური ქალაქის შიდა ქალაქად ჩამოყალიბდა. IV საუკუნიდან უფლისციხე, ისევე როგორც ადრინდელი კლასობრივი ხანის ზოგიერთი სხვა ქალაქი, დაქვეითდა და მხოლოდ სამხრეთ სტრატეგიული მნიშვნელობა შერჩა. საქართველოს გაერთიანებისათვის ბრძოლის პერიოდში (IX-X საუკუნეები) დასუსტებული ციხე-ქალაქი უფლისციხე ხელიდან ხელში გადადიოდა. IX-X საუკუნეებში უფლისციხეში გაბატონებისათვის თავგამოდებით იბრძოდნენ ქართველი მეფეები, კახეთის მთავრები და სომხეთის მეფეები. საქართველოს პოლიტიკური გაერთიანების შემდეგ (X საუკუნის 70-იანი წლები) უფლისციხემ თანდათანობით დაკარგა მნიშვნელობა. ეს პროცესი დავით აღმაშენებლის მიერ 1122 თბილისის განთავისუფლებით დაგვირგვინდა."}
]

page = {
    "ალავერდი": "/geohistory/1",
    "კაცხის სვეტი": "/geohistory/2",
    "უფლისციხე": "/geohistory/3",

}

@app.route('/')
def home():
    return render_template('index.html', geohistory=geohistory)

@app.route('/profile/<int:id>')
def profile(id):
    profile = profiles[id]
    return render_template('profile.html', profile=profile)

@app.route('/search')
def search():
    search_text = request.args.get('text')

    if not search_text:
        return redirect(url_for("home"))

    search_text = search_text.lower().strip()

    if search_text in page:
        return redirect((page[search_text]))

    return redirect(url_for("home"))

@app.route('/about')
def about():
    return render_template('about.html')

@app.route('/login')
def login():
    return render_template('login.html')

@app.route('/add_history', methods=["GET",'POST'])
def add_history():
    form = HistoryForm()
    if form.validate_on_submit():
        new_history = History(history_title = form.history_title.data, description = form.description.data)
        img = form.image.data
        if img:
            directory = path.join(app.root_path, "static", "images", img.filename)
            img.save(directory)
            new_history.image = img.filename

        db.session.add(new_history)
        db.session.commit()
    return render_template("add_history.html", form=form)


@app.route('/register', methods=['GET', 'POST'])
def register():
    form = registerForm()
    if form.validate_on_submit():
        new_user = {
            "username": form.username.data,
            "password": form.password.data,
            "email": form.email.data,
            "mobile": form.mobile.data,
            "date": form.birthdate.data,
            "gender": form.gender.data,
            "country": form.country.data
        }
        profiles.append(new_user)
        print(new_user)
    return render_template('register.html', form=form)

@app.route('/geohistory/<int:geo_id>')
def see_geo(geo_id):
    for geo in geohistory:
        if geo["id"] == geo_id:
            return render_template('geohistory.html', place=geo)
    return "place not found"